const blackListWords = [
    'підманула', 'підвела',
    'понеділок', 'вівторок', 'середу', 'четвер', 'п’ятницю', 'суботу', 'неділю'
];

const comment = `
Ти казала в понеділок – підем разом по барвінок.
Я прийшов, тебе нема, підманула, підвела.
Ти ж мене підманула, ти ж мене підвела.
Ти ж мене, молодого, з ума розуму звела.

Я казала у вівторок – поцілую разів сорок.
Ти прийшов, мене нема, підманула, підвела.
Я ж тебе підманула, я ж тебе підвела.
Я ж тебе, молодого, з ума розуму звела.

Ти казала у середу – підем разом по череду.
Я прийшов, тебе нема, підманула, підвела.
Ти ж мене підманула, ти ж мене підвела.
Ти ж мене, молодого, з ума розуму звела.

Я казала у четвер – підем разом на концерт.
Ти прийшов, мене нема, підманула, підвела.
Ти ж мене підманула, ти ж мене підвела.
Ти ж мене, молодого, з ума розуму звела.

Ти казала у п’ятницю – підем разом по пшеницю.
Я прийшов, тебе нема, підманула, підвела.
Я ж тебе підманула, ти ж мене підвела.
Ти ж його, молодого, з ума розуму звела.

Я казала у суботу – підем разом на роботу.
Я прийшов, тебе нема, підманула, підвела.
Я ж тебе підманула, ти ж мене підвела.
Ти ж його, молодого, з ума розуму звела.

Я казала у неділю – підем разом на весілля.
Я прийшов, тебе нема, підманула, підвела.
Ти ж мене підманула, ти ж мене підвела.
Ти ж мене, молодого, з ума розуму звела.
`;

function filterBadWords(string, badWords) {
    let newComment = string;
    badWords.forEach(word => {
        const stars = '*'.repeat(word.length - 2);
        newComment = newComment.replaceAll(word, `${word[0]}${stars}${word[word.length - 1]}`);
    });
    return newComment;
}

const filteredComment = filterBadWords(comment, blackListWords);
console.log(filteredComment);

// let newComment = comment;
// blackListWords.forEach(word => {
//     let regex = new RegExp(`\\b${word}\\b`, 'gi');
//     let stars = '*'.repeat(word.length - 2);
//     newComment = newComment.replaceAll(regex, `${word[0]}${stars}${word[word.length - 1]}`);
// });